[Killed] BlockStatement
main/pages/PersonalSchedules/PersonalSchedulesEditPage.js:51:30
     },
   });
   const onSuccess = () => {};
-  const onError = (error) => {
-    toast(`Error: ${error.response.data.message}`);
-  };
+  const onError = (error) => {};
   const mutation = useBackendMutation(
     objectToAxiosParams,
killedBy: PersonalSchedulesEditPage tests tests where backend is working normally when the backend returns an error, user gets toast with error message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error: The backend is in a mood today"

Number of calls: 0
