[Killed] ObjectLiteral
main/components/Sections/SectionsInstructorTable.js:14:5
 
 export default function SectionsInstructorTable({ sections }) {
   const columns = [
-    {
-      Header: "Quarter",
-      accessor: (row) => yyyyqToQyy(row.courseInfo.quarter),
-      disableGroupBy: true,
-      id: "quarter",
-      Cell: ({ cell: { value } }) => value,
-    },
+    {},
     {
       Header: "Course ID",
killedBy: CourseOverTimeInstructorIndexPage tests renders without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BooleanLiteral
main/components/Sections/SectionsInstructorTable.js:17:23
     {
       Header: "Quarter",
       accessor: (row) => yyyyqToQyy(row.courseInfo.quarter),
-      disableGroupBy: true,
+      disableGroupBy: false,
       id: "quarter",
       Cell: ({ cell: { value } }) => value,
killedBy: Section tests Each column has disableGroupBy set to true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
main/components/Sections/SectionsInstructorTable.js:19:13
       accessor: (row) => yyyyqToQyy(row.courseInfo.quarter),
       disableGroupBy: true,
       id: "quarter",
-      Cell: ({ cell: { value } }) => value,
+      Cell: () => undefined,
     },
     {
killedBy: Section tests Has the expected cell values
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  S22
Received:

[Killed] BooleanLiteral
main/components/Sections/SectionsInstructorTable.js:24:23
     {
       Header: "Course ID",
       accessor: "courseInfo.courseId",
-      disableGroupBy: true,
+      disableGroupBy: false,
       Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
     },
killedBy: Section tests Each column has disableGroupBy set to true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
main/components/Sections/SectionsInstructorTable.js:25:38
       Header: "Course ID",
       accessor: "courseInfo.courseId",
       disableGroupBy: true,
-      Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
+      Cell: ({ cell: { value } }) => value,
     },
     {
killedBy: Section tests Has the expected cell values
statusReason: Error: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  CMPSC 130A -1
Received:
  CMPSC 130A -1

[Killed] ArrowFunction
main/components/Sections/SectionsInstructorTable.js:25:13
       Header: "Course ID",
       accessor: "courseInfo.courseId",
       disableGroupBy: true,
-      Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
+      Cell: () => undefined,
     },
     {
killedBy: Section tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  CMPSC 130A
Received:

[Killed] BooleanLiteral
main/components/Sections/SectionsInstructorTable.js:30:23
     {
       Header: "Title",
       accessor: "courseInfo.title",
-      disableGroupBy: true,
+      disableGroupBy: false,
     },
     {
killedBy: Section tests Each column has disableGroupBy set to true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
main/components/Sections/SectionsInstructorTable.js:35:23
     {
       Header: "Status",
       accessor: (row) => formatStatus(row.section),
-      disableGroupBy: true,
+      disableGroupBy: false,
       id: "status",
     },
killedBy: Section tests Each column has disableGroupBy set to true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
main/components/Sections/SectionsInstructorTable.js:38:5
       disableGroupBy: true,
       id: "status",
     },
-    {
-      Header: "Enrolled",
-      accessor: (row) =>
-        convertToFraction(row.section.enrolledTotal, row.section.maxEnroll),
-      disableGroupBy: true,
-      id: "enrolled",
-    },
+    {},
     {
       Header: "Location",
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BooleanLiteral
main/components/Sections/SectionsInstructorTable.js:42:23
       Header: "Enrolled",
       accessor: (row) =>
         convertToFraction(row.section.enrolledTotal, row.section.maxEnroll),
-      disableGroupBy: true,
+      disableGroupBy: false,
       id: "enrolled",
     },
killedBy: Section tests Each column has disableGroupBy set to true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
main/components/Sections/SectionsInstructorTable.js:45:5
       disableGroupBy: true,
       id: "enrolled",
     },
-    {
-      Header: "Location",
-      accessor: (row) => formatLocation(row.section.timeLocations),
-      disableGroupBy: true,
-      id: "location",
-    },
+    {},
     {
       Header: "Days",
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BooleanLiteral
main/components/Sections/SectionsInstructorTable.js:48:23
     {
       Header: "Location",
       accessor: (row) => formatLocation(row.section.timeLocations),
-      disableGroupBy: true,
+      disableGroupBy: false,
       id: "location",
     },
killedBy: Section tests Each column has disableGroupBy set to true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
main/components/Sections/SectionsInstructorTable.js:51:5
       disableGroupBy: true,
       id: "location",
     },
-    {
-      Header: "Days",
-      accessor: (row) => formatDays(row.section.timeLocations),
-      disableGroupBy: true,
-      id: "days",
-    },
+    {},
     {
       Header: "Time",
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BooleanLiteral
main/components/Sections/SectionsInstructorTable.js:54:23
     {
       Header: "Days",
       accessor: (row) => formatDays(row.section.timeLocations),
-      disableGroupBy: true,
+      disableGroupBy: false,
       id: "days",
     },
killedBy: Section tests Each column has disableGroupBy set to true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
main/components/Sections/SectionsInstructorTable.js:60:23
     {
       Header: "Time",
       accessor: (row) => formatTime(row.section.timeLocations),
-      disableGroupBy: true,
+      disableGroupBy: false,
       id: "time",
     },
killedBy: Section tests Each column has disableGroupBy set to true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
main/components/Sections/SectionsInstructorTable.js:63:5
       disableGroupBy: true,
       id: "time",
     },
-    {
-      Header: "Instructor",
-      accessor: (row) => formatInstructors(row.section.instructors),
-      disableGroupBy: true,
-      id: "instructor",
-    },
+    {},
     {
       Header: "Enroll Code",
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BooleanLiteral
main/components/Sections/SectionsInstructorTable.js:66:23
     {
       Header: "Instructor",
       accessor: (row) => formatInstructors(row.section.instructors),
-      disableGroupBy: true,
+      disableGroupBy: false,
       id: "instructor",
     },
killedBy: Section tests Each column has disableGroupBy set to true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
main/components/Sections/SectionsInstructorTable.js:69:5
       disableGroupBy: true,
       id: "instructor",
     },
-    {
-      Header: "Enroll Code",
-      accessor: "section.enrollCode",
-      disableGroupBy: true,
-    },
+    {},
   ];
 
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BooleanLiteral
main/components/Sections/SectionsInstructorTable.js:72:23
     {
       Header: "Enroll Code",
       accessor: "section.enrollCode",
-      disableGroupBy: true,
+      disableGroupBy: false,
     },
   ];
killedBy: Section tests Each column has disableGroupBy set to true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
